SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #BR_Green_6316
 comment ( BR_Green_6316)
 Type ( Engine )
 WagonShape ( BR_Green_6316.s )
 Size ( 2.71438m 4.11575m 10.1474m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 0.00238648m 2.08742m 0.0201244m )
 Mass ( 56.92t )
 InertiaTensor ( Box(2.71438m 4.11575m 10.1474m ) )
Coupling (
 Type ( Bar )
 Spring (
 Stiffness ( 1e7N/m 1e7N/m )
 Damping ( 0.2e7N/m/s 0.2e7N/m/s )
 Break ( 1e7N 1e7N )
 r0 ( 10cm 1e9 )
 )
 CouplingHasRigidConnection ()
 Velocity (0.1m/s)
 )

Coupling (
 Type ( Chain )
 Spring (
 Stiffness ( 1e6N/m 2e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 Break ( 3.2e7N 3.2e7N )
 r0 ( 20cm 40cm )
 )
 )
 Freightanim ( gwcrew13.s 0.1 0.1 )
 Adheasion ( 0.5 0.64 0.215 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 2.5*59.74t )
 DerailBufferForce ( 800kN )
 WheelRadius ( 3.0322m )
 NumWheels ( 4 )
 Friction (
 8328.2N/m/s 0.25 6.0mph
 8.966/m/s 1.929 1
 5.1N/rad/s 1 -1rad/s 0 1
 )

 BrakeEquipmentType( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType( "Vacuum_single_pipe" )
 MaxBrakeForce( 37.752kN )

 MaxHandbrakeForce( 56.2kN )
 NumberOfHandbrakeLeverSteps( 100 )
 
 MaxReleaseRate( 10 )
 MaxApplicationRate( 10 )
 MaxAuxilaryChargingRate( 10 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 ) 

 Sound ("..\\..\\common.sound\\SteamSoundsOrgUk\\#GWR-Manor-66-100-11.sms" )

 Lights ( 14
 Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 20ffffff )
 Position ( 0 2.5 15 )
 Transition ( 0 )
 Radius ( 80.0 )
 Angle ( 13.0 )
 
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( 0 2.0 -3.901 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.4 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ffe610 )
 Position ( 0 2.0 -3.901 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.4 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 99EBCEB2 )
 Position ( 0.8301 1.55 3.901)
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.4 )
 Elevation ( -10 -10 -10 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 99EBCEB2 )
 Position ( 0.0 3.43 3.13)
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.4 )
 Elevation ( -10 -10 -10 )
 )
 )
 )
Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ff7200 )
 Position ( 0 0.1 -9 )
 Transition ( 0 )
 Radius ( 7.0 )
 Angle ( 100.0 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 Coupling ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.09 )
 LightColour ( 40ff0000 )
 Position ( 0 0.50 -2.50 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 2.3 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 40ff4000 )
 Position ( 0 0.50 -2.50 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 2.3 )
 Elevation ( -10 -10 -10 )
 )
 )
 )

Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 Coupling ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 40ff4000 )
 Position ( 0 0.50 -2.5 )
 Azimuth ( -90.0 -90.0 -90.0 )
 Transition ( 0 )
 Radius ( 2.7 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.09 )
 LightColour ( 40ff0000 )
 Position ( 0 0.50 -2.5 )
 Azimuth ( -90.0 -90.0 -90 )
 Transition ( 0 )
 Radius ( 2.7 )
 Elevation ( -10 -10 -10 )
 )
 )
 )

Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 Coupling ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.09 )
 LightColour ( 40ff0000 )
 Position ( 0 0.50 -2.50 )
 Azimuth ( 90.0 90.0 90.0 )
 Transition ( 0 )
 Radius ( 2.7 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 40ff4000 )
 Position ( 0 0.50 -2.50 )
 Azimuth ( 90.0 90.0 90.0 )
 Transition ( 0 )
 Radius ( 2.7 )
 Elevation ( -10 -10 -10 )
 )
 )
 )

Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 Coupling ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.24 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.24 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 )
 )



Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 Coupling ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.24 )
 Azimuth ( 0 90 90 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.24 )
 Azimuth ( 90.0 90.0 90.0 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 )
 )



Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 Coupling ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.24 )
 Azimuth ( -90 -90 -90 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.24 )
 Azimuth ( -90.0 -90.0 -90.0 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 )
 )

Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 Coupling ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.56 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.09 )
 LightColour ( 80ff7200 )
 Position ( 0 3.86 2.24 )
 Azimuth ( 180.0 180.0 180.0 )
 Transition ( 0 )
 Radius ( 0.7 )
 Elevation ( -10 -10 -10 )
 )
 )
 )

 )
)

Engine ( #BR_Green_6316 

 Effects
 (
 SteamSpecialEffects
 (
 comment
 (
 the format of these little blocks is as follow:

 offset.x offset.y offset.z
 normal.x normal.y normal.z
 width in metres

 defining the offset from the shape pivot point
 where steam / smoke should appear, the direction
 it should go and the width of the nozzle
 )

 WhistleFX
 (
 0 3.97 -3.5
 0 1 0
 0.05
 )

 SafetyValvesFX
 (
 0 3.92 -0.64
 0 1 0
 0.2
 )

 StackFX
 (
 0 4.04 2.26
 0 1 0
 0.2
 )

 DrainpipeFX
 (
 -1.5 1.258 -2.886
 -0.4 -1 -0.2
 0.05
 )

 CylindersFX
 (
 -0.7 0.85 2.92
 0 0 1
 0.1
 )

 CylindersFX
 (
 0.7 0.85 2.92
 0 0 1
 0.1
 )
 )
 )

 Wagon ( #BR_Green_6316 )
 IsTenderRequired( 1 ) 
 Type ( Steam )
 MaxPower ( 967kW )
 MaxForce ( 25669lbf )
 MaxVelocity ( 73mph )
 WheelRadius ( 5.4286m )
 Sanding ( 1e9mph )
 NumWheels ( 1 )
 BoilerLength ( 5.49m )
 BoilerVolume ( "270.35*(ft^3)" )
 BoilerEffectivity ( 1.2 )
 DraftingEffect ( 0.95 )
 BoilerResponsiveness ( 1.05 )
 CoalBurnage ( 5.3lb/hp/h )
 MaxBoilerOutput ( 26070lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 30in )
 CylinderDiameter ( 18.5in )
 CylinderVolume ( "18.67*(ft^3)" )
 CylinderEffectivity ( 1.4 )
 InjectorSizes ( 10mm 11mm )
 ExhaustLimit ( 29272lb/h )
 PrimingFactor ( .95 )
 SteamMinPrimingLevel ( 1.1 )
 BlastExponent ( 0.6 )
 MaxBoilerPressure ( 200psi )
 MaxFireMass ( 1465lb )
 IdealFireMass ( 1069lb )
 MaxWaterMass ( 2921lb ) 
 SafetyValvesSteamUsage ( 9677lb/h )
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 14560lb )
 MaxTenderWaterMass ( 35000lb )

 
 InjectorTypes( 0 1 ) 
 SuperHeater ( 1.23 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 SteamMaxSmokeUnitsReleaseRate( 1 )
 MaxSteamHeatingPressure( 20 )
 SafetyValvePressureDifference( 7 )
 SteamGaugeGlassHeight( 6.6 )
 SteamFiremanMaxPossibleFiringRate( 30000 )

 BasicSteamUsage ( 20lb/h )
 BasicCoalUsage ( 110lb/h )

 
 InjectorLimits1 ( 50psi 0.6 1 )
 InjectorLimits2 ( 60psi 0.5 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 VacuumBrakesSmallEjectorPowerRating( 3.5 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 300 )
 VacuumBrakesLargeEjectorUsageRate( 950 )
 VacuumBrakesHasVacuumPump( 0 )

 TrainBrakesControllerMaxReleaseRate( 12 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 25 )

 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType( "Vacuum_single_pipe" )
 BrakesTrainBrakeType( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )

 SteamSmallestCutoff( 8 )
 NumberOfDamperSteps( 4 )

 RegulatorValveType( Twin_port )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorPilotValveExponent( 1.7 )
 RegulatorSecondValveExponent( 1.7 )
 RegulatorPilotValveFullOpenning( 0.3 )
 RegulatorMainValveInitialOpenning( 0.4 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) 
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 SteamWaterScoopMinPickupSpeed( 25 ) 
 SteamWaterScoopMaxPickupSpeed( 60 ) 
 SteamWaterScoopResistance( 8500N )
 
 SteamWaterScoopMaxPickupRate( 1000 )


 
 

 EngineControllers (
 
 
 Regulator ( 0 1 0.025 0 
 NumNotches( 0 )
 )
 Cutoff ( -0.77 0.76 0.01 0 
 NumNotches( 23
 Notch ( -0.77 0 Dummy )
 Notch ( -0.73 0 Dummy )
 Notch ( -0.67 0 Dummy )
 Notch ( -0.55 0 Dummy )
 Notch ( -0.45 0 Dummy )
 Notch ( -0.36 0 Dummy )
 Notch ( -0.31 0 Dummy )
 Notch ( -0.27 0 Dummy )
 Notch ( -0.25 0 Dummy )
 Notch ( -0.24 0 Dummy )
 Notch ( -0.22 0 Dummy )
 Notch ( 0 0 Dummy )
 Notch ( 0.22 0 Dummy )
 Notch ( 0.24 0 Dummy )
 Notch ( 0.26 0 Dummy )
 Notch ( 0.30 0 Dummy )
 Notch ( 0.34 0 Dummy )
 Notch ( 0.39 0 Dummy )
 Notch ( 0.45 0 Dummy )
 Notch ( 0.58 0 Dummy )
 Notch ( 0.68 0 Dummy )
 Notch ( 0.73 0 Dummy )
 Notch ( 0.76 0 Dummy ) 
 )
 )
 Brake_Train ( 0 1 0.01 0.65 
 NumNotches( 3
 Notch(0 1 TrainBrakesControllerReleaseStart )
 Notch(0.4 1 TrainBrakesControllerRunningStart )
 Notch(0.5 1 TrainBrakesControllerApplyStart )
 )
 )
 Brake_Hand ( 0 1 0.0125 0 
 NumNotches( 0 )
 )
 FireDoor ( 0 1 0.1 1 
 NumNotches( 0 )
 )
 Sanding( 0 1 0 )
 Blower ( 0 1 0.025 0.2 
 NumNotches( 0 )
 )
 HeatingTap ( 0 1 0.025 0 
 NumNotches( 0 )
 )
 Shovel ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 DampersFront ( 0 1 0.1 1 
 NumNotches( 0 )
 )
 DampersBack ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 Injector1Steam ( 0 1 0 )
 Injector2Steam ( 0 1 0 )
 Injector1Water ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 Injector2Water ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 CylinderCocks ( 0 1 1 )
 Whistle ( 0 1 0 )
 WaterScoop ( 0 1 0 )
 SmallEjectorOrCompressor( 0 1 1 )
 Headlights( 0 1 0 )
 )

 comment(fire temp, fire mass, water mass, boiler pressure,
 water level, tender_water_mass, tender_coal_mass,
 smoke_quantity, fire_condition, coal quality )
 
 EngineVariables( 900 1069 2247 190 1.0 35000 1.0 1 1.0 .85 )

 

 Name ( "# BR_Green_6316" )
 Description (
 " "
 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+ 
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)
